#+TITLE: Meta.org Archive
#    -*- mode: org -*-
Archived entries from file /zfs/home/zz/ii/apisnoop_v3/org/meta.org
** sequence

#+BEGIN_SRC sql-mode
CREATE SEQUENCE public.audit_events_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;
ALTER SEQUENCE public.audit_events_id_seq OWNED BY public.audit_events.id;
#+END_SRC

#+RESULTS:
: CREATE SEQUENCE
: ALTER SEQUENCE
** api_operations Materialized view
   :PROPERTIES:
   :ARCHIVE_TIME: 2019-08-12 Mon 02:15
   :ARCHIVE_FILE: ~/ii/apisnoop_v3/org/meta.org
   :ARCHIVE_OLPATH: Operation Views/api_operations view
   :ARCHIVE_CATEGORY: meta
   :END:
 #+NAME: api_operations materialized view
 #+BEGIN_SRC sql-mode :eval never-export :notangle ../apps/hasura/migrations/150_view_api_operations.up.sql :results silent
   CREATE MATERIALIZED VIEW "public"."mat_api_operations" AS 
     SELECT raw_swaggers.id AS raw_swagger_id,
            paths.key AS path,
            regex_from_path(paths.key) as regex,
            d.key AS http_method,
            (d.value ->> 'x-kubernetes-action'::text) AS k8s_action,
            (d.value ->> 'operationId'::text) AS operation_id,
            ((d.value -> 'x-kubernetes-group-version-kind'::text) ->> 'group'::text) AS k8s_group,
            ((d.value -> 'x-kubernetes-group-version-kind'::text) ->> 'version'::text) AS k8s_version,
            ((d.value -> 'x-kubernetes-group-version-kind'::text) ->> 'kind'::text) AS k8s_kind,
            (d.value ->> 'description'::text) AS description,
            (d.value -> 'consumes'::text) AS consumes,
            (d.value -> 'responses'::text) AS responses,
            (d.value -> 'parameters'::text) AS parameters,
            (lower((d.value ->> 'description'::text)) ~~ '%deprecated%'::text) AS deprecated,
            split_part((cat_tag.value ->> 0), '_'::text, 1) AS category,
            string_agg(btrim((jsonstring.value)::text, '"'::text), ', '::text) AS tags,
            string_agg(btrim((schemestring.value)::text, '"'::text), ', '::text) AS schemes,
            CASE
             WHEN (d.value ->> 'x-kubernetes-action'::text) IN ('get', 'list', 'proxy') THEN 'get'
             WHEN (d.value ->> 'x-kubernetes-action'::text) IN ('deleteCollection', 'delete', 'deletecollection') THEN 'delete'
             WHEN (d.value ->> 'x-kubernetes-action'::text) IN ('watch', 'watchlist', 'watch') THEN 'watch'
             WHEN (d.value ->> 'x-kubernetes-action'::text) IN ('create', 'post') THEN 'post'
             WHEN (d.value ->> 'x-kubernetes-action'::text) IN ( 'update', 'put' ) THEN 'put'
             WHEN (d.value ->> 'x-kubernetes-action'::text) = 'patch' THEN 'patch'
             WHEN (d.value ->> 'x-kubernetes-action'::text) = 'connect' THEN 'connect'
            ELSE NULL
              END as event_verb
       FROM raw_swaggers
       , jsonb_each((raw_swaggers.data -> 'paths'::text)) paths(key, value)
       , jsonb_each(paths.value) d(key, value)
       , jsonb_array_elements((d.value -> 'tags'::text)) cat_tag(value)
       , jsonb_array_elements((d.value -> 'tags'::text)) jsonstring(value)
       , jsonb_array_elements((d.value -> 'schemes'::text)) schemestring(value)
      GROUP BY raw_swaggers.id, paths.key, d.key, d.value, cat_tag.value
      ORDER BY paths.key;
 #+END_SRC


 #+BEGIN_SRC sql-mode
   CREATE INDEX on mat_api_operations (operation_id);
   CREATE INDEX on mat_api_operations (regex);
 #+END_SRC

 #+RESULTS:
 #+begin_src sql-mode
 CREATE INDEX
 #+end_src

 #+NAME: api_operations indexes the raw_swagger
 #+BEGIN_SRC sql-mode :tangle ../apps/hasura/migrations/100_table_raw_swaggers.up.sql :results silent
   -- CREATE INDEX idx_swagger_gin_paths ON raw_swaggers USING GIN ((data->>'paths'));
   -- CREATE INDEX idx_swagger_btree_paths ON raw_swaggers USING BTREE ((data->>'paths'));
   -- CREATE INDEX idx_swagger_hash_paths ON raw_swaggers USING HASH ((data->>'paths'))
        -- api_operations view:
        --  , jsonb_each((raw_swaggers.data -> 'paths'::text)) paths(key, value)
        --  , jsonb_each(paths.value) d(key, value)
        --  , jsonb_array_elements((d.value -> 'tags'::text)) cat_tag(value)
        --  , jsonb_array_elements((d.value -> 'tags'::text)) jsonstring(value)
        --  , jsonb_array_elements((d.value -> 'schemes'::text)) schemestring(value)
        -- GROUP BY raw_swaggers.id, paths.key, d.key, d.value, cat_tag.value
        -- ORDER BY paths.key;
        -- api_resources view:
        --   , jsonb_each((raw_swaggers.data -> 'definitions'::text)) d(key, value)
        --   , jsonb_array_elements((d.value -> 'required'::text)) reqstring(value)
        -- GROUP BY raw_swaggers.id, d.key, d.value;
   -- CREATE INDEX idx_swagger_X ON raw_swagger USING GIN ((jsb->‘X’));
   -- CREATE INDEX idx_swagger_X ON raw_swagger USING BTREE ((jsb->>‘X’));
   -- CREATE INDEX idx_swagger_X ON raw_swagger USING HASH ((jsb->>‘X’))
   #+END_SRC

   #+RESULTS: api_operations indexes the raw_swagger
   #+begin_src sql-mode
       event_verb    
   ------------------
    create
    delete
    deletecollection
    get
    list
    patch
    update
   (7 rows)

   #+end_src

 #
 #+NAME: uniq audit entry verbs raw
 #+BEGIN_SRC shell
 cd /tmp/apisnoop-ci-kubernetes-e2e-gci-gce-11349620722877112346arl78tw
 cat audit.log | jq .verb | sort | uniq
 #+END_SRC

 #+RESULTS: uniq audit entry verbs raw
 #+begin_EXAMPLE
 "abcd"
 "create"
 "delete"
 "deletecollection"
 "get"
 "list"
 "patch"
 "post"
 "update"
 "watch"
 #+end_EXAMPLE


 #+NAME: Double check operation_id verbs
 #+BEGIN_SRC sql-mode
 SELECT DISTINCT k8s_action, http_method
 FROM api_operations
 order by k8s_action;
 #+END_SRC

 #+RESULTS: Double check operation_id verbs
 #+begin_src sql-mode
     k8s_action    | http_method 
 ------------------+-------------
  connect          | delete
  connect          | get
  connect          | head
  connect          | options
  connect          | patch
  connect          | post
  connect          | put
  delete           | delete
  deletecollection | delete
  get              | get
  list             | get
  patch            | patch
  post             | post
  put              | put
  watch            | get
  watchlist        | get
                   | get
 (17 rows)

 #+end_src
 #+NAME: Double check operation_id verbs

 #+NAME: method = options
 #+BEGIN_SRC sql-mode
 SELECT operation_id, k8s_action, http_method, path
 FROM api_operations
 where http_method like 'options';
 #+END_SRC

 #+RESULTS: method = options
 #+begin_src sql-mode
                     operation_id                    | k8s_action | http_method |                            path                             
 ----------------------------------------------------+------------+-------------+-------------------------------------------------------------
  connectCoreV1OptionsNamespacedPodProxy             | connect    | options     | /api/v1/namespaces/{namespace}/pods/{name}/proxy
  connectCoreV1OptionsNamespacedPodProxyWithPath     | connect    | options     | /api/v1/namespaces/{namespace}/pods/{name}/proxy/{path}
  connectCoreV1OptionsNamespacedServiceProxy         | connect    | options     | /api/v1/namespaces/{namespace}/services/{name}/proxy
  connectCoreV1OptionsNamespacedServiceProxyWithPath | connect    | options     | /api/v1/namespaces/{namespace}/services/{name}/proxy/{path}
  connectCoreV1OptionsNodeProxy                      | connect    | options     | /api/v1/nodes/{name}/proxy
  connectCoreV1OptionsNodeProxyWithPath              | connect    | options     | /api/v1/nodes/{name}/proxy/{path}
 (6 rows)

 #+end_src

 #+NAME: Double check audit_entries verbs / ops
 #+BEGIN_SRC sql-mode
 explain SELECT DISTINCT event_verb
 FROM audit_events;
 -- order by event_verb;
 #+END_SRC

 #+RESULTS: Double check audit_entries verbs / ops
 #+begin_src sql-mode
                                                                    QUERY PLAN                                                                   
 ------------------------------------------------------------------------------------------------------------------------------------------------
  Unique  (cost=18311202947114.33..18320060226114.33 rows=313532 width=32)
    ->  Sort  (cost=18311202947114.33..18315631586614.33 rows=1771455800000 width=32)
          Sort Key: ((raw.data ->> 'verb'::text))
          ->  Nested Loop  (cost=8857888750630.28..17654133088298.60 rows=1771455800000 width=32)
                Join Filter: ((raw.data ->> 'requestURI'::text) ~ ops.regex)
                ->  Seq Scan on raw_audit_events raw  (cost=0.00..50648.32 rows=313532 width=1091)
                ->  Materialize  (cost=8857888750630.28..9027707225240.28 rows=1130000000 width=32)
                      ->  Subquery Scan on ops  (cost=8857888750630.28..9027693850630.28 rows=1130000000 width=32)
                            ->  GroupAggregate  (cost=8857888750630.28..9027682550630.28 rows=1130000000 width=549)
                                  Group Key: paths.key, raw_swaggers.id, d.key, d.value, cat_tag.value
                                  ->  Sort  (cost=8857888750630.28..8886138750630.28 rows=11300000000000 width=132)
                                        Sort Key: paths.key, raw_swaggers.id, d.key, d.value, cat_tag.value
                                        ->  Nested Loop  (cost=0.02..228282828281.32 rows=11300000000000 width=132)
                                              ->  Nested Loop  (cost=0.02..2282828281.32 rows=113000000000 width=132)
                                                    ->  Nested Loop  (cost=0.01..22828281.31 rows=1130000000 width=132)
                                                          ->  Nested Loop  (cost=0.01..228281.31 rows=11300000 width=100)
                                                                ->  Nested Loop  (cost=0.01..2281.30 rows=113000 width=68)
                                                                      ->  Seq Scan on raw_swaggers  (cost=0.00..21.30 rows=1130 width=36)
                                                                      ->  Function Scan on jsonb_each paths  (cost=0.01..1.00 rows=100 width=64)
                                                                ->  Function Scan on jsonb_each d  (cost=0.00..1.00 rows=100 width=64)
                                                          ->  Function Scan on jsonb_array_elements cat_tag  (cost=0.01..1.00 rows=100 width=32)
                                                    ->  Function Scan on jsonb_array_elements jsonstring  (cost=0.01..1.00 rows=100 width=0)
                                              ->  Function Scan on jsonb_array_elements schemestring  (cost=0.01..1.00 rows=100 width=0)
 (23 rows)

 #+end_src


 #+RESULTS: api_operations view
 #+begin_src sql-mode
 CREATE VIEW
 #+end_src

 #+NAME: track api_operations
 #+BEGIN_SRC yaml :tangle ../apps/hasura/migrations/150_view_api_operations.up.yaml
 - type: track_table
   args:
     schema: public
     name: api_operations
 #+END_SRC


 #+NAME: possible indexes
 #+BEGIN_SRC sql-mode :eval never
 create index api_operations_id on api_operations(id);
 create index api_operations_method on api_operations(method);
 create index api_operations_regexp on api_operations(regexp);
 #+END_SRC

***** Load Audit Events
     
      We need to match our event to an operation ID.
      An operation ID is unique on raw_swagger_id, http method, and regex.
      So we should try to match the vent on the same three.
      raw.data ->> 'requestURI' ~ ops.regex
      raw.data ->> 'verb' = 
      ops.raw_swagger_id = 1
  #+NAME: experimental load_audit_events.sh
  #+BEGIN_SRC shell :var AUDIT_LOG="../data/artifacts/ci-kubernetes-e2e-gci-gce/1134962072287711234/combined-audit.log"

   BUCKET='ci-kubernetes-e2e-gci-gce'
   JOB='1134962072287711234'
   SQL="
   CREATE TEMPORARY TABLE raw_audit_events_import (data jsonb not null) ;
   copy raw_audit_events_import (data)
   FROM STDIN (DELIMITER e'\x02', FORMAT 'csv', QUOTE e'\x01');
   INSERT INTO zraw_audit_events(data, bucket, job, audit_id, event_verb, request_uri, operation_id)
   SELECT raw.data, '$BUCKET', '$JOB', (raw.data ->> 'auditID'), (raw.data ->> 'verb'), (raw.data ->> 'requestURI'), ops.operation_id
   FROM raw_audit_events_import raw
   LEFT JOIN api_operations_material ops ON
        ops.raw_swagger_id = 1
        AND raw.data ->> 'verb' = ops.event_verb
        AND raw.data ->> 'requestURI' ~ ops.regex;
   "
   cat $AUDIT_LOG | psql -c "$SQL" 2>&1
   date
  #+END_SRC

  #+RESULTS: experimental load_audit_events.sh
  #+begin_EXAMPLE
  INSERT 0 313431
  Mon Aug 12 22:41:18 UTC 2019
  #+end_EXAMPLE
  ** event_verb_to_http_method

  
  #+BEGIN_SRC sql-mode
 SELECT DISTINCT audit_id, operation_id
 FROM zraw_audit_events;
  #+END_SRC
 
  #+NAME: Distinct Key
  #+BEGIN_SRC sql-mode
 select distinct data->'requestObject'->>'kind' as keys
 from zraw_audit_events
 order by keys;
  #+END_SRC

  #+RESULTS: Distinct Keys
  #+begin_src sql-mode
                keys              
  --------------------------------
   APIService
   Binding
   CertificateSigningRequest
   ClusterRole
   ClusterRoleBinding
   ControllerRevision
   CronJob
   CSIDriver
   CSINode
   CustomResourceDefinition
   DaemonSet
   DeleteOptions
   Deployment
   DeploymentRollback
   Endpoints
   HorizontalPodAutoscaler
   Job
   LimitRange
   MutatingWebhookConfiguration
   Namespace
   Node
   PersistentVolume
   PersistentVolumeClaim
   Pod
   PodDisruptionBudget
   PodSecurityPolicy
   PodTemplate
   PriorityClass
   ReplicaSet
   ReplicationController
   ResourceQuota
   Role
   RoleBinding
   RuntimeClass
   Scale
   Service
   ServiceAccount
   StatefulSet
   StorageClass
   SubjectAccessReview
   ValidatingWebhookConfiguration
   VolumeAttachment
  (43 rows)

  #+end_src

 
  - we did a join, and got 50k results, which seemed too small.
  - the join is based on matching regex, event_verb, and raw_swagger_id 
  - raw events is 300k, it shoudl be closer to that?
  - what is the reason for nulls?  how often is i
  #+NAME: Audit_events without matching operations: sample
  #+BEGIN_SRC sql-mode
    SELECT
      distinct event_verb
    FROM
      zraw_audit_events
    LIMIT 50;
  #+END_SRC

  #+RESULTS: Audit_events without matching operations: sample
  #+begin_src sql-mode
      event_verb    
  ------------------
   list
   deletecollection
   delete
   update
   get
   create
   post
   abcd
   watch
   patch
  (10 rows)

  #+end_src

  #+BEGIN_SRC sql-mode
    SELECT
      path, regex
    FROM
      api_operations_material 
     WHERE
       path LIKE '/apis/authorization.k8s.io/v1beta1/subjectaccessreviews%';

  #+END_SRC
 
  #+BEGIN_SRC sql-mode
 select distinct param_kind from api_resources_fields order by param_kind;
 -- select * from api_resources_fields where param_kind ilike '%PodSpec';
  #+END_SRC


  #+RESULTS:
  #+begin_src sql-mode
                                             param_kind                                            
  -------------------------------------------------------------------------------------------------
   integer
   io.k8s.api.admissionregistration.v1beta1.MutatingWebhookConfiguration
   io.k8s.api.admissionregistration.v1beta1.RuleWithOperations
   io.k8s.api.admissionregistration.v1beta1.ValidatingWebhookConfiguration
   io.k8s.api.admissionregistration.v1beta1.WebhookClientConfig
   io.k8s.api.admissionregistration.v1.MutatingWebhookConfiguration
   io.k8s.api.admissionregistration.v1.RuleWithOperations
   io.k8s.api.admissionregistration.v1.ValidatingWebhookConfiguration
   io.k8s.api.admissionregistration.v1.WebhookClientConfig
   io.k8s.api.apps.v1beta1.ControllerRevision
   io.k8s.api.apps.v1beta1.Deployment
   io.k8s.api.apps.v1beta1.DeploymentStrategy
   io.k8s.api.apps.v1beta1.RollbackConfig
   io.k8s.api.apps.v1beta1.StatefulSet
   io.k8s.api.apps.v1beta1.StatefulSetCondition
   io.k8s.api.apps.v1beta1.StatefulSetUpdateStrategy
   io.k8s.api.apps.v1beta2.ControllerRevision
   io.k8s.api.apps.v1beta2.DaemonSet
   io.k8s.api.apps.v1beta2.DaemonSetCondition
   io.k8s.api.apps.v1beta2.DaemonSetUpdateStrategy
   io.k8s.api.apps.v1beta2.Deployment
   io.k8s.api.apps.v1beta2.DeploymentStrategy
   io.k8s.api.apps.v1beta2.ReplicaSet
   io.k8s.api.apps.v1beta2.ReplicaSetCondition
   io.k8s.api.apps.v1beta2.StatefulSet
   io.k8s.api.apps.v1beta2.StatefulSetCondition
   io.k8s.api.apps.v1beta2.StatefulSetUpdateStrategy
   io.k8s.api.apps.v1.ControllerRevision
   io.k8s.api.apps.v1.DaemonSet
   io.k8s.api.apps.v1.DaemonSetCondition
   io.k8s.api.apps.v1.DaemonSetUpdateStrategy
   io.k8s.api.apps.v1.Deployment
   io.k8s.api.apps.v1.DeploymentStrategy
   io.k8s.api.apps.v1.ReplicaSet
   io.k8s.api.apps.v1.ReplicaSetCondition
   io.k8s.api.apps.v1.StatefulSet
   io.k8s.api.apps.v1.StatefulSetCondition
   io.k8s.api.apps.v1.StatefulSetUpdateStrategy
   io.k8s.api.auditregistration.v1alpha1.AuditSink
   io.k8s.api.auditregistration.v1alpha1.Policy
   io.k8s.api.auditregistration.v1alpha1.Webhook
   io.k8s.api.auditregistration.v1alpha1.WebhookClientConfig
   io.k8s.api.auditregistration.v1alpha1.WebhookThrottleConfig
   io.k8s.api.authentication.v1beta1.TokenReviewSpec
   io.k8s.api.authentication.v1beta1.TokenReviewStatus
   io.k8s.api.authentication.v1.BoundObjectReference
   io.k8s.api.authentication.v1.TokenRequestSpec
   io.k8s.api.authentication.v1.TokenRequestStatus
   io.k8s.api.authentication.v1.TokenReviewSpec
   io.k8s.api.authentication.v1.TokenReviewStatus
   io.k8s.api.authorization.v1beta1.NonResourceRule
   io.k8s.api.authorization.v1beta1.ResourceRule
   io.k8s.api.authorization.v1beta1.SelfSubjectAccessReviewSpec
   io.k8s.api.authorization.v1beta1.SelfSubjectRulesReviewSpec
   io.k8s.api.authorization.v1beta1.SubjectAccessReviewSpec
   io.k8s.api.authorization.v1beta1.SubjectAccessReviewStatus
   io.k8s.api.authorization.v1beta1.SubjectRulesReviewStatus
   io.k8s.api.authorization.v1.NonResourceRule
   io.k8s.api.authorization.v1.ResourceRule
   io.k8s.api.authorization.v1.SelfSubjectAccessReviewSpec
   io.k8s.api.authorization.v1.SelfSubjectRulesReviewSpec
   io.k8s.api.authorization.v1.SubjectAccessReviewSpec
   io.k8s.api.authorization.v1.SubjectAccessReviewStatus
   io.k8s.api.authorization.v1.SubjectRulesReviewStatus
   io.k8s.api.autoscaling.v1.CrossVersionObjectReference
   io.k8s.api.autoscaling.v1.HorizontalPodAutoscaler
   io.k8s.api.autoscaling.v2beta1.CrossVersionObjectReference
   io.k8s.api.autoscaling.v2beta1.ExternalMetricSource
   io.k8s.api.autoscaling.v2beta1.ExternalMetricStatus
   io.k8s.api.autoscaling.v2beta1.HorizontalPodAutoscaler
   io.k8s.api.autoscaling.v2beta1.HorizontalPodAutoscalerCondition
   io.k8s.api.autoscaling.v2beta1.MetricSpec
   io.k8s.api.autoscaling.v2beta1.MetricStatus
   io.k8s.api.autoscaling.v2beta1.ObjectMetricSource
   io.k8s.api.autoscaling.v2beta1.ObjectMetricStatus
   io.k8s.api.autoscaling.v2beta1.PodsMetricSource
   io.k8s.api.autoscaling.v2beta1.PodsMetricStatus
   io.k8s.api.autoscaling.v2beta1.ResourceMetricSource
   io.k8s.api.autoscaling.v2beta1.ResourceMetricStatus
   io.k8s.api.autoscaling.v2beta2.CrossVersionObjectReference
   io.k8s.api.autoscaling.v2beta2.ExternalMetricSource
   io.k8s.api.autoscaling.v2beta2.ExternalMetricStatus
   io.k8s.api.autoscaling.v2beta2.HorizontalPodAutoscaler
   io.k8s.api.autoscaling.v2beta2.HorizontalPodAutoscalerCondition
   io.k8s.api.autoscaling.v2beta2.MetricIdentifier
   io.k8s.api.autoscaling.v2beta2.MetricSpec
   io.k8s.api.autoscaling.v2beta2.MetricStatus
   io.k8s.api.autoscaling.v2beta2.MetricTarget
   io.k8s.api.autoscaling.v2beta2.MetricValueStatus
   io.k8s.api.autoscaling.v2beta2.ObjectMetricSource
   io.k8s.api.autoscaling.v2beta2.ObjectMetricStatus
   io.k8s.api.autoscaling.v2beta2.PodsMetricSource
   io.k8s.api.autoscaling.v2beta2.PodsMetricStatus
   io.k8s.api.autoscaling.v2beta2.ResourceMetricSource
   io.k8s.api.autoscaling.v2beta2.ResourceMetricStatus
   io.k8s.api.batch.v1beta1.CronJob
   io.k8s.api.batch.v1beta1.JobTemplateSpec
   io.k8s.api.batch.v1.Job
   io.k8s.api.batch.v2alpha1.CronJob
   io.k8s.api.batch.v2alpha1.JobTemplateSpec
   io.k8s.api.certificates.v1beta1.CertificateSigningRequest
   io.k8s.api.coordination.v1beta1.Lease
   io.k8s.api.coordination.v1.Lease
   io.k8s.api.core.v1.Affinity
   io.k8s.api.core.v1.AWSElasticBlockStoreVolumeSource
   io.k8s.api.core.v1.AzureDiskVolumeSource
   io.k8s.api.core.v1.AzureFileVolumeSource
   io.k8s.api.core.v1.CephFSVolumeSource
   io.k8s.api.core.v1.CinderVolumeSource
   io.k8s.api.core.v1.ComponentStatus
   io.k8s.api.core.v1.ConfigMap
   io.k8s.api.core.v1.ConfigMapVolumeSource
   io.k8s.api.core.v1.Container
   io.k8s.api.core.v1.ContainerPort
   io.k8s.api.core.v1.ContainerState
   io.k8s.api.core.v1.CSIVolumeSource
   io.k8s.api.core.v1.DownwardAPIVolumeSource
   io.k8s.api.core.v1.EmptyDirVolumeSource
   io.k8s.api.core.v1.Endpoints
   io.k8s.api.core.v1.EnvFromSource
   io.k8s.api.core.v1.EnvVar
   io.k8s.api.core.v1.EnvVarSource
   io.k8s.api.core.v1.EphemeralContainer
   io.k8s.api.core.v1.Event
   io.k8s.api.core.v1.EventSeries
   io.k8s.api.core.v1.EventSource
   io.k8s.api.core.v1.FCVolumeSource
   io.k8s.api.core.v1.FlexVolumeSource
   io.k8s.api.core.v1.FlockerVolumeSource
   io.k8s.api.core.v1.GCEPersistentDiskVolumeSource
   io.k8s.api.core.v1.GitRepoVolumeSource
   io.k8s.api.core.v1.GlusterfsVolumeSource
   io.k8s.api.core.v1.HostAlias
   io.k8s.api.core.v1.HostPathVolumeSource
   io.k8s.api.core.v1.HTTPHeader
   io.k8s.api.core.v1.ISCSIVolumeSource
   io.k8s.api.core.v1.Lifecycle
   io.k8s.api.core.v1.LimitRange
   io.k8s.api.core.v1.LimitRangeItem
   io.k8s.api.core.v1.LocalObjectReference
   io.k8s.api.core.v1.Namespace
   io.k8s.api.core.v1.NFSVolumeSource
   io.k8s.api.core.v1.Node
   io.k8s.api.core.v1.NodeSelectorTerm
   io.k8s.api.core.v1.ObjectFieldSelector
   io.k8s.api.core.v1.ObjectReference
   io.k8s.api.core.v1.PersistentVolume
   io.k8s.api.core.v1.PersistentVolumeClaim
   io.k8s.api.core.v1.PersistentVolumeClaimVolumeSource
   io.k8s.api.core.v1.PhotonPersistentDiskVolumeSource
   io.k8s.api.core.v1.Pod
   io.k8s.api.core.v1.PodAffinityTerm
   io.k8s.api.core.v1.PodDNSConfig
   io.k8s.api.core.v1.PodReadinessGate
   io.k8s.api.core.v1.PodSecurityContext
   io.k8s.api.core.v1.PodTemplate
   io.k8s.api.core.v1.PodTemplateSpec
   io.k8s.api.core.v1.PortworxVolumeSource
   io.k8s.api.core.v1.Probe
   io.k8s.api.core.v1.ProjectedVolumeSource
   io.k8s.api.core.v1.QuobyteVolumeSource
   io.k8s.api.core.v1.RBDVolumeSource
   io.k8s.api.core.v1.ReplicationController
   io.k8s.api.core.v1.ReplicationControllerCondition
   io.k8s.api.core.v1.ResourceFieldSelector
   io.k8s.api.core.v1.ResourceQuota
   io.k8s.api.core.v1.ResourceRequirements
   io.k8s.api.core.v1.ScaleIOVolumeSource
   io.k8s.api.core.v1.Secret
   io.k8s.api.core.v1.SecretReference
   io.k8s.api.core.v1.SecretVolumeSource
   io.k8s.api.core.v1.SecurityContext
   io.k8s.api.core.v1.SELinuxOptions
   io.k8s.api.core.v1.Service
   io.k8s.api.core.v1.ServiceAccount
   io.k8s.api.core.v1.StorageOSVolumeSource
   io.k8s.api.core.v1.Toleration
   io.k8s.api.core.v1.TopologySelectorTerm
   io.k8s.api.core.v1.TopologySpreadConstraint
   io.k8s.api.core.v1.Volume
   io.k8s.api.core.v1.VolumeDevice
   io.k8s.api.core.v1.VolumeMount
   io.k8s.api.core.v1.VolumeProjection
   io.k8s.api.core.v1.VsphereVirtualDiskVolumeSource
   io.k8s.api.events.v1beta1.Event
   io.k8s.api.events.v1beta1.EventSeries
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceColumnDefinition
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceConversion
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinition
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionCondition
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionNames
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionSpec
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionStatus
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionVersion
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceSubresources
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceValidation
   io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.WebhookClientConfig
   io.k8s.api.extensions.v1beta1.AllowedCSIDriver
   io.k8s.api.extensions.v1beta1.AllowedFlexVolume
   io.k8s.api.extensions.v1beta1.AllowedHostPath
   io.k8s.api.extensions.v1beta1.DaemonSet
   io.k8s.api.extensions.v1beta1.DaemonSetCondition
   io.k8s.api.extensions.v1beta1.DaemonSetUpdateStrategy
   io.k8s.api.extensions.v1beta1.Deployment
   io.k8s.api.extensions.v1beta1.DeploymentStrategy
   io.k8s.api.extensions.v1beta1.FSGroupStrategyOptions
   io.k8s.api.extensions.v1beta1.HostPortRange
   io.k8s.api.extensions.v1beta1.HTTPIngressPath
   io.k8s.api.extensions.v1beta1.IDRange
   io.k8s.api.extensions.v1beta1.Ingress
   io.k8s.api.extensions.v1beta1.IngressBackend
   io.k8s.api.extensions.v1beta1.NetworkPolicy
   io.k8s.api.extensions.v1beta1.NetworkPolicyEgressRule
   io.k8s.api.extensions.v1beta1.NetworkPolicyIngressRule
   io.k8s.api.extensions.v1beta1.PodSecurityPolicy
   io.k8s.api.extensions.v1beta1.ReplicaSet
   io.k8s.api.extensions.v1beta1.ReplicaSetCondition
   io.k8s.api.extensions.v1beta1.RollbackConfig
   io.k8s.api.extensions.v1beta1.RunAsGroupStrategyOptions
   io.k8s.api.extensions.v1beta1.RunAsUserStrategyOptions
   io.k8s.api.extensions.v1beta1.RuntimeClassStrategyOptions
   io.k8s.api.extensions.v1beta1.SELinuxStrategyOptions
   io.k8s.api.extensions.v1beta1.SupplementalGroupsStrategyOptions
   io.k8s.apimachinery.pkg.api.resource.Quantity
   io.k8s.apimachinery.pkg.apis.meta.v1.APIGroup
   io.k8s.apimachinery.pkg.apis.meta.v1.APIResource
   io.k8s.apimachinery.pkg.apis.meta.v1.GroupVersionForDiscovery
   io.k8s.apimachinery.pkg.apis.meta.v1.LabelSelector
   io.k8s.apimachinery.pkg.apis.meta.v1.ListMeta
   io.k8s.apimachinery.pkg.apis.meta.v1.MicroTime
   io.k8s.apimachinery.pkg.apis.meta.v1.ObjectMeta
   io.k8s.apimachinery.pkg.apis.meta.v1.ServerAddressByClientCIDR
   io.k8s.apimachinery.pkg.apis.meta.v1.Time
   io.k8s.apimachinery.pkg.runtime.RawExtension
   io.k8s.apimachinery.pkg.util.intstr.IntOrString
   io.k8s.api.networking.v1beta1.HTTPIngressPath
   io.k8s.api.networking.v1beta1.Ingress
   io.k8s.api.networking.v1beta1.IngressBackend
   io.k8s.api.networking.v1.NetworkPolicy
   io.k8s.api.networking.v1.NetworkPolicyEgressRule
   io.k8s.api.networking.v1.NetworkPolicyIngressRule
   io.k8s.api.node.v1alpha1.Overhead
   io.k8s.api.node.v1alpha1.RuntimeClass
   io.k8s.api.node.v1alpha1.RuntimeClassSpec
   io.k8s.api.node.v1beta1.Overhead
   io.k8s.api.node.v1beta1.RuntimeClass
   io.k8s.api.policy.v1beta1.AllowedCSIDriver
   io.k8s.api.policy.v1beta1.AllowedFlexVolume
   io.k8s.api.policy.v1beta1.AllowedHostPath
   io.k8s.api.policy.v1beta1.FSGroupStrategyOptions
   io.k8s.api.policy.v1beta1.HostPortRange
   io.k8s.api.policy.v1beta1.IDRange
   io.k8s.api.policy.v1beta1.PodDisruptionBudget
   io.k8s.api.policy.v1beta1.PodSecurityPolicy
   io.k8s.api.policy.v1beta1.RunAsGroupStrategyOptions
   io.k8s.api.policy.v1beta1.RunAsUserStrategyOptions
   io.k8s.api.policy.v1beta1.RuntimeClassStrategyOptions
   io.k8s.api.policy.v1beta1.SELinuxStrategyOptions
   io.k8s.api.policy.v1beta1.SupplementalGroupsStrategyOptions
   io.k8s.api.rbac.v1alpha1.ClusterRole
   io.k8s.api.rbac.v1alpha1.ClusterRoleBinding
   io.k8s.api.rbac.v1alpha1.Role
   io.k8s.api.rbac.v1alpha1.RoleBinding
   io.k8s.api.rbac.v1alpha1.RoleRef
   io.k8s.api.rbac.v1alpha1.Subject
   io.k8s.api.rbac.v1beta1.ClusterRole
   io.k8s.api.rbac.v1beta1.ClusterRoleBinding
   io.k8s.api.rbac.v1beta1.Role
   io.k8s.api.rbac.v1beta1.RoleBinding
   io.k8s.api.rbac.v1beta1.RoleRef
   io.k8s.api.rbac.v1beta1.Subject
   io.k8s.api.rbac.v1.ClusterRole
   io.k8s.api.rbac.v1.ClusterRoleBinding
   io.k8s.api.rbac.v1.Role
   io.k8s.api.rbac.v1.RoleBinding
   io.k8s.api.rbac.v1.RoleRef
   io.k8s.api.rbac.v1.Subject
   io.k8s.api.scheduling.v1alpha1.PriorityClass
   io.k8s.api.scheduling.v1beta1.PriorityClass
   io.k8s.api.scheduling.v1.PriorityClass
   io.k8s.api.settings.v1alpha1.PodPreset
   io.k8s.api.storage.v1alpha1.VolumeAttachment
   io.k8s.api.storage.v1alpha1.VolumeAttachmentSource
   io.k8s.api.storage.v1alpha1.VolumeAttachmentSpec
   io.k8s.api.storage.v1alpha1.VolumeAttachmentStatus
   io.k8s.api.storage.v1alpha1.VolumeError
   io.k8s.api.storage.v1beta1.CSIDriver
   io.k8s.api.storage.v1beta1.CSIDriverSpec
   io.k8s.api.storage.v1beta1.CSINode
   io.k8s.api.storage.v1beta1.CSINodeDriver
   io.k8s.api.storage.v1beta1.CSINodeSpec
   io.k8s.api.storage.v1beta1.StorageClass
   io.k8s.api.storage.v1beta1.VolumeAttachment
   io.k8s.api.storage.v1beta1.VolumeAttachmentSource
   io.k8s.api.storage.v1beta1.VolumeAttachmentSpec
   io.k8s.api.storage.v1beta1.VolumeAttachmentStatus
   io.k8s.api.storage.v1beta1.VolumeError
   io.k8s.api.storage.v1beta1.VolumeNodeResources
   io.k8s.api.storage.v1.StorageClass
   io.k8s.api.storage.v1.VolumeAttachment
   io.k8s.api.storage.v1.VolumeAttachmentSource
   io.k8s.api.storage.v1.VolumeAttachmentSpec
   io.k8s.api.storage.v1.VolumeAttachmentStatus
   io.k8s.api.storage.v1.VolumeError
   io.k8s.kube-aggregator.pkg.apis.apiregistration.v1.APIService
   io.k8s.kube-aggregator.pkg.apis.apiregistration.v1beta1.APIService
   io.k8s.kube-aggregator.pkg.apis.apiregistration.v1beta1.ServiceReference
   io.k8s.kube-aggregator.pkg.apis.apiregistration.v1.ServiceReference
   string
  (309 rows)

  #+end_src
 
  #+BEGIN_SRC sql-mode
    select
       distinct request_uri
    from
      zraw_audit_events
    where 
      operation_id IS NULL
      AND event_verb = 'get'
      AND request_uri like '/api%'
      AND request_uri not like '%proxy%'
      AND request_uri like '%timeout%'

    order by request_uri
    LIMIT 500;
  #+END_SRC

  #+RESULTS:
  #+begin_src sql-mode
                                    request_uri                                   
  --------------------------------------------------------------------------------
   /apis/admissionregistration.k8s.io/v1beta1?timeout=32s
   /apis/apiextensions.k8s.io/v1beta1?timeout=32s
   /apis/apiregistration.k8s.io/v1beta1?timeout=32s
   /apis/apiregistration.k8s.io/v1?timeout=32s
   /apis/apps/v1beta1?timeout=32s
   /apis/apps/v1beta2?timeout=32s
   /apis/apps/v1?timeout=32s
   /apis/authentication.k8s.io/v1beta1?timeout=32s
   /apis/authentication.k8s.io/v1?timeout=32s
   /apis/authorization.k8s.io/v1beta1?timeout=32s
   /apis/authorization.k8s.io/v1?timeout=32s
   /apis/autoscaling/v1?timeout=32s
   /apis/autoscaling/v2beta1?timeout=32s
   /apis/autoscaling/v2beta2?timeout=32s
   /apis/batch/v1beta1?timeout=32s
   /apis/batch/v1?timeout=32s
   /apis/batch/v2alpha1?timeout=32s
   /apis/certificates.k8s.io/v1beta1?timeout=32s
   /apis/coordination.k8s.io/v1beta1?timeout=32s
   /apis/coordination.k8s.io/v1?timeout=32s
   /apis/crd-publish-openapi-test-common-group.k8s.io/v4?timeout=32s
   /apis/crd-publish-openapi-test-common-group.k8s.io/v5?timeout=32s
   /apis/crd-publish-openapi-test-common-group.k8s.io/v6?timeout=32s
   /apis/crd-publish-openapi-test-empty.k8s.io/v1?timeout=32s
   /apis/crd-publish-openapi-test-foo.k8s.io/v1?timeout=32s
   /apis/crd-publish-openapi-test-multi-to-single-ver.k8s.io/v5?timeout=32s
   /apis/crd-publish-openapi-test-multi-to-single-ver.k8s.io/v6alpha1?timeout=32s
   /apis/crd-publish-openapi-test-multi-ver.k8s.io/v2?timeout=32s
   /apis/crd-publish-openapi-test-multi-ver.k8s.io/v3?timeout=32s
   /apis/crd-publish-openapi-test-multi-ver.k8s.io/v4?timeout=32s
   /apis/crd-publish-openapi-test-waldo.k8s.io/v1beta1?timeout=32s
   /apis/discovery-crd-test.k8s.io/v1?timeout=32s
   /apis/events.k8s.io/v1beta1?timeout=32s
   /apis/extensions/v1beta1?timeout=32s
   /apis/kubectl-crd-test.k8s.io/v1?timeout=32s
   /apis/metrics.k8s.io/v1beta1?timeout=32s
   /apis/mygroup.example.com/v1beta1?timeout=32s
   /apis/networking.k8s.io/v1beta1?timeout=32s
   /apis/networking.k8s.io/v1?timeout=32s
   /apis/node.k8s.io/v1beta1?timeout=32s
   /apis/policy/v1beta1?timeout=32s
   /apis/rbac.authorization.k8s.io/v1beta1?timeout=32s
   /apis/rbac.authorization.k8s.io/v1?timeout=32s
   /apis/resourcequota-crd-test.k8s.io/v1?timeout=32s
   /apis/scalingpolicy.kope.io/v1alpha1?timeout=32s
   /apis/scheduling.k8s.io/v1alpha1?timeout=32s
   /apis/scheduling.k8s.io/v1beta1?timeout=32s
   /apis/scheduling.k8s.io/v1?timeout=32s
   /apis/settings.k8s.io/v1alpha1?timeout=32s
   /apis/snapshot.storage.k8s.io/v1alpha1?timeout=32s
   /apis/stable.example.com/v1?timeout=32s
   /apis/stable.example.com/v2?timeout=32s
   /apis/storage.k8s.io/v1beta1?timeout=32s
   /apis/storage.k8s.io/v1?timeout=32s
   /apis?timeout=32s
   /apis/wardle.k8s.io/v1alpha1?timeout=32s
   /apis/webhook-crd-test.k8s.io/v1?timeout=32s
   /apis/webhook-multiversion-crd-test.k8s.io/v1?timeout=32s
   /apis/webhook-multiversion-crd-test.k8s.io/v2?timeout=32s
   /api?timeout=32s
   /api/v1?timeout=32s
  (61 rows)

  #+end_src

** load audit_events_via local cli
   :PROPERTIES:
   :ARCHIVE_TIME: 2019-08-14 Wed 23:56
   :ARCHIVE_FILE: ~/ii/apisnoop_v3/org/meta.org
   :ARCHIVE_CATEGORY: meta
   :END:

 #+BEGIN_SRC sql-mode
   \d raw_audit_events;
   -- delete from raw_audit_events;
 #+END_SRC

 #+RESULTS:
 #+begin_src sql-mode
                                    Table "public.raw_audit_events"
    Column    |            Type             | Collation | Nullable |             Default              
 -------------+-----------------------------+-----------+----------+----------------------------------
  id          | integer                     |           | not null | generated by default as identity
  ingested_at | timestamp without time zone |           |          | CURRENT_TIMESTAMP
  bucket      | text                        |           |          | 
  job         | text                        |           |          | 
  data        | jsonb                       |           | not null | 
 Indexes:
     "raw_audit_events_pkey" PRIMARY KEY, btree (id)

 #+end_src


 #+NAME: load_audit_events.sh
 #+BEGIN_SRC shell :var AUDIT_LOG="../data/artifacts/ci-kubernetes-e2e-gci-gce/1134962072287711234/combined-audit.log"
   BUCKET='ci-kubernetes-e2e-gci-gce'
   JOB='1134962072287711234'
   SQL="
   CREATE TEMPORARY TABLE raw_audit_events_import (data jsonb not null) ;
   copy raw_audit_events_import (data)
   FROM STDIN (DELIMITER e'\x02', FORMAT 'csv', QUOTE e'\x01');
   INSERT INTO raw_audit_events(data, bucket, job)
   SELECT data, '$BUCKET', '$JOB'
   FROM raw_audit_events_import;
   "
   cat $AUDIT_LOG | psql -c "$SQL"
   date
 #+END_SRC

 #+RESULTS: load_audit_events.sh
 #+begin_EXAMPLE
 INSERT 0 313431
 Thu Aug  8 01:14:52 UTC 2019
 #+end_EXAMPLE

 #+BEGIN_SRC sql-mode
   select distinct bucket, job from raw_audit_events;
 #+END_SRC

 #+RESULTS:
 #+begin_src sql-mode
  bucket  | job  
 ---------+------
  bucket1 | job1
 (1 row)

 #+end_src

 #+BEGIN_SRC sql-mode
 \dt+
 #+END_SRC

 #+RESULTS:
 #+begin_src sql-mode
                           List of relations
  Schema |       Name       | Type  | Owner |    Size    | Description 
 --------+------------------+-------+-------+------------+-------------
  public | audit_events     | table | zz    | 8192 bytes | 
  public | raw_audit_events | table | zz    | 376 MB     | 
  public | raw_swaggers     | table | zz    | 1752 kB    | 
 (3 rows)

 #+end_src

** load audit_events_via local cli
   :PROPERTIES:
   :ARCHIVE_TIME: 2019-08-14 Wed 23:56
   :ARCHIVE_FILE: ~/ii/apisnoop_v3/org/meta.org
   :ARCHIVE_CATEGORY: meta
   :END:

 #+BEGIN_SRC sql-mode
   \d raw_audit_events;
   -- delete from raw_audit_events;
 #+END_SRC

 #+RESULTS:
 #+begin_src sql-mode
                                    Table "public.raw_audit_events"
    Column    |            Type             | Collation | Nullable |             Default              
 -------------+-----------------------------+-----------+----------+----------------------------------
  id          | integer                     |           | not null | generated by default as identity
  ingested_at | timestamp without time zone |           |          | CURRENT_TIMESTAMP
  bucket      | text                        |           |          | 
  job         | text                        |           |          | 
  data        | jsonb                       |           | not null | 
 Indexes:
     "raw_audit_events_pkey" PRIMARY KEY, btree (id)

 #+end_src


 #+NAME: load_audit_events.sh
 #+BEGIN_SRC shell :var AUDIT_LOG="../data/artifacts/ci-kubernetes-e2e-gci-gce/1134962072287711234/combined-audit.log"
   BUCKET='ci-kubernetes-e2e-gci-gce'
   JOB='1134962072287711234'
   SQL="
   CREATE TEMPORARY TABLE raw_audit_events_import (data jsonb not null) ;
   copy raw_audit_events_import (data)
   FROM STDIN (DELIMITER e'\x02', FORMAT 'csv', QUOTE e'\x01');
   INSERT INTO raw_audit_events(data, bucket, job)
   SELECT data, '$BUCKET', '$JOB'
   FROM raw_audit_events_import;
   "
   cat $AUDIT_LOG | psql -c "$SQL"
   date
 #+END_SRC

 #+RESULTS: load_audit_events.sh
 #+begin_EXAMPLE
 INSERT 0 313431
 Thu Aug  8 01:14:52 UTC 2019
 #+end_EXAMPLE

 #+BEGIN_SRC sql-mode
   select distinct bucket, job from raw_audit_events;
 #+END_SRC

 #+RESULTS:
 #+begin_src sql-mode
  bucket  | job  
 ---------+------
  bucket1 | job1
 (1 row)

 #+end_src

 #+BEGIN_SRC sql-mode
 \dt+
 #+END_SRC

 #+RESULTS:
 #+begin_src sql-mode
                           List of relations
  Schema |       Name       | Type  | Owner |    Size    | Description 
 --------+------------------+-------+-------+------------+-------------
  public | audit_events     | table | zz    | 8192 bytes | 
  public | raw_audit_events | table | zz    | 376 MB     | 
  public | raw_swaggers     | table | zz    | 1752 kB    | 
 (3 rows)

 #+end_src

